#Область ПрограммныйИнтерфейс
// Описание
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Команда - Структура
//  Обработчик - ОписаниеОповещения
Процедура ПоказатьДиалогЗаписиОбъектаДляВыполненияПодключаемойКоманды(Форма, Команда, Обработчик) Экспорт
	
	Если Не Форма.Параметры.Свойство("Ключ") Или Форма.Параметры.Ключ.Пустая() Тогда
		ИмяКоманды = Команда.Имя;
		АдресНастроек = Форма.ПараметрыПодключаемыхКоманд.АдресТаблицыКоманд;
		ОписаниеКоманды = ПодключаемыеКомандыКлиентПовтИсп.ОписаниеКоманды(ИмяКоманды, АдресНастроек);
		
		Если Форма.Объект.Ссылка.Пустая()
			Или (ОписаниеКоманды.РежимЗаписи <> "ЗаписыватьТолькоНовые" И Форма.Модифицированность) Тогда
			ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				СтрШаблон("Данные еще не записаны.
						|Выполнение действия ""%1"" возможно только после записи данных.
						|Данные будут записаны."),
				ОписаниеКоманды.Представление);
			ПоказатьВопрос(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(Обработчик, Неопределено);
	
КонецПроцедуры

#КонецОбласти
